[
  "dataview",
  "obsidian-excalidraw-plugin",
  "calendar",
  "obsidian-tasks-plugin",
  "templater-obsidian",
  "table-editor-obsidian",
  "obsidian-git",
  "obsidian-style-settings",
  "obsidian-icon-folder",
  "obsidian-day-planner",
  "obsidian-enhancing-export"
]