[
  "obsidian-kanban",
  "table-editor-obsidian",
  "calendar",
  "dataview",
  "templater-obsidian",
  "obsidian-excalidraw-plugin",
  "obsidian-outliner",
  "obsidian-mind-map",
  "obsidian-minimal-settings",
  "oz-image-plugin",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-style-settings"
]